Тест_ЗУП_31_КОРП/src/Catalogs/ШаблоныПроизвольныхКадровыхПриказов/ШаблоныПроизвольныхКадровыхПриказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПроизвольныхКадровыхПриказов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НесколькоСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетРуководитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетГлавныйБухгалтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетКассир</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетРуководительКадровойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетБухгалтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеПечатныеФормы</name>
    <attributes>
      <name>ПечатнаяФорма</name>
      <type>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/ШаблоныПроизвольныхКадровыхПриказов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НастройкиВидаДокумента(Шаблон) Экспорт
	
	СтруктураНастроек = Новый Структура(
	"Наименование,
	|НесколькоСотрудников,
	|ПодписываетРуководитель,
	|ПодписываетГлавныйБухгалтер,
	|ПодписываетКассир,
	|ПодписываетРуководительКадровойСлужбы,
	|ПодписываетБухгалтер,
	|ПоказыватьПодразделение,
	|ПроверятьЗаполнениеПодразделения");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ШаблоныПроизвольныхКадровыхПриказов.Наименование,
	|	ШаблоныПроизвольныхКадровыхПриказов.НесколькоСотрудников,
	|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетРуководитель,
	|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетГлавныйБухгалтер,
	|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетКассир,
	|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетРуководительКадровойСлужбы,
	|	ШаблоныПроизвольныхКадровыхПриказов.ПодписываетБухгалтер,
	|	ШаблоныПроизвольныхКадровыхПриказов.ПоказыватьПодразделение,
	|	ШаблоныПроизвольныхКадровыхПриказов.ПроверятьЗаполнениеПодразделения
	|ИЗ
	|	Справочник.ШаблоныПроизвольныхКадровыхПриказов КАК ШаблоныПроизвольныхКадровыхПриказов
	|ГДЕ
	|	ШаблоныПроизвольныхКадровыхПриказов.Ссылка = &Шаблон";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Предназначена для получения актуальных видов документов.
//
Функция ТаблицаВидовДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШаблоныПроизвольныхКадровыхПриказов.Ссылка КАК ВидДокумента,
	|	ШаблоныПроизвольныхКадровыхПриказов.Наименование КАК Наименование,
	|	ШаблоныПроизвольныхКадровыхПриказов.Наименование КАК Представление,
	|	ШаблоныПроизвольныхКадровыхПриказов.Родитель
	|ИЗ
	|	Справочник.ШаблоныПроизвольныхКадровыхПриказов КАК ШаблоныПроизвольныхКадровыхПриказов
	|ГДЕ
	|	НЕ ШаблоныПроизвольныхКадровыхПриказов.ПометкаУдаления
	|	И НЕ ШаблоныПроизвольныхКадровыхПриказов.ЭтоГруппа
	|	И НЕ ШаблоныПроизвольныхКадровыхПриказов.ВАрхиве";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДоступныеВнешниеПечатныеФормы(Шаблон) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроизвольныхКадровыхПриказовВнешниеПечатныеФормы.ПечатнаяФорма КАК ПечатнаяФорма
	|ИЗ
	|	Справочник.ШаблоныПроизвольныхКадровыхПриказов.ВнешниеПечатныеФормы КАК ШаблоныПроизвольныхКадровыхПриказовВнешниеПечатныеФормы
	|ГДЕ
	|	ШаблоныПроизвольныхКадровыхПриказовВнешниеПечатныеФормы.Ссылка = &Шаблон";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПечатнаяФорма");
	
КонецФункции

#КонецОбласти

#КонецЕсли
